document.write ("<h1>daramji (외부파일)</h1>")

/*
    드디어 자바스크립트이다. 자바스크립트는 웹에서 동작을 구현하기 위한 언어로써, 동적 구현을 위한 스크립트 언어이다.
    html은 웹의 내용, css는 스타일, 자바스크립트는 웹에서 동작을 맡는다.
    자바스크립트는 controller을 담당하고, html과 css는 view와 model을 담당한다. (MVC 모델 아키텍처)

    자바스크립트는 코어 부분인 ECMAScript, 문서 객체 모델인 DOM, 브라우저 객체 모델인 BOM이 통합된 언어이다.
    OOP를 따르고 있다. 객체지향 언어의 특징은 데이터 중심의 프로그래밍이 가능하다는 점이며, 이러면 코드의 재사용성이 높아진다.
    자바스크립트는 작성하는 방식이 아래와 같다.

    1) 대소문자를 구별해야 함 : HTML과 CSS에서는 대소문자 구별을 하지 않지만 JS에서는 한다.
    2) 문장은 세미콜론으로 구분한다
    3) 큰따옴표와 작은따옴표를 구변한다. 이때 `` (backsqeot)라고 하는 것도 있는데 여기에 변수를 입력할 수도 있다.
    
    자바스크립트를 참조하는 방법은 크게 3가지이다.
    1) HTML 내부에 script 태그를 열어서 자바스크립트 명령어 작성
    2) 외부 파일에 JS 파일 작성 후 HTML 문서 내에서 <script src="~~~~"></script> 하기
    3) 일부는 외부에, 일부는 내부에
*/